{
  "model": "yoloe-26s-seg",
  "imgsz": 640,
  "num_classes": 125,
  "names": {
    "0": "backpack",
    "1": "bag",
    "2": "barrier",
    "3": "bed",
    "4": "bench",
    "5": "bicycle",
    "6": "bin",
    "7": "blackboard",
    "8": "bollard",
    "9": "book",
    "10": "bookshelf",
    "11": "bottle",
    "12": "box",
    "13": "bucket",
    "14": "button",
    "15": "cabinet",
    "16": "calendar",
    "17": "camera",
    "18": "car",
    "19": "carpet",
    "20": "ceiling light",
    "21": "cell phone",
    "22": "chair",
    "23": "clock",
    "24": "column",
    "25": "computer",
    "26": "cone",
    "27": "container",
    "28": "control panel",
    "29": "conveyor",
    "30": "corridor",
    "31": "couch",
    "32": "crosswalk",
    "33": "cup",
    "34": "curb",
    "35": "curtain",
    "36": "desk",
    "37": "door",
    "38": "drain",
    "39": "drawer",
    "40": "elevator",
    "41": "emergency exit sign",
    "42": "entrance",
    "43": "equipment",
    "44": "escalator",
    "45": "exit",
    "46": "exit sign",
    "47": "faucet",
    "48": "fence",
    "49": "fire alarm",
    "50": "fire extinguisher",
    "51": "fire hydrant",
    "52": "floor lamp",
    "53": "flower",
    "54": "forklift",
    "55": "gate",
    "56": "grate",
    "57": "guardrail",
    "58": "hallway",
    "59": "handrail",
    "60": "keyboard",
    "61": "lamp",
    "62": "laptop",
    "63": "light",
    "64": "machine",
    "65": "manhole",
    "66": "mat",
    "67": "microwave",
    "68": "mirror",
    "69": "monitor",
    "70": "motorcycle",
    "71": "mouse",
    "72": "obstacle",
    "73": "oven",
    "74": "painting",
    "75": "pallet",
    "76": "panel",
    "77": "paper",
    "78": "parking meter",
    "79": "pedestrian",
    "80": "people",
    "81": "person",
    "82": "phone",
    "83": "pillar",
    "84": "pipe",
    "85": "plant",
    "86": "pole",
    "87": "potted plant",
    "88": "printer",
    "89": "projector",
    "90": "recycling bin",
    "91": "refrigerator",
    "92": "road",
    "93": "robot",
    "94": "rock",
    "95": "rug",
    "96": "safety cone",
    "97": "screen",
    "98": "shelf",
    "99": "sidewalk",
    "100": "sign",
    "101": "sink",
    "102": "sofa",
    "103": "speaker",
    "104": "staircase",
    "105": "stairs",
    "106": "stool",
    "107": "stop sign",
    "108": "suitcase",
    "109": "switch",
    "110": "table",
    "111": "toilet",
    "112": "traffic light",
    "113": "trash can",
    "114": "truck",
    "115": "tv",
    "116": "umbrella",
    "117": "valve",
    "118": "vase",
    "119": "wall",
    "120": "wardrobe",
    "121": "washing machine",
    "122": "water dispenser",
    "123": "whiteboard",
    "124": "window"
  }
}